# Read the three files into python as dataframes

In [153]:
import pandas as pd


df1=pd.read_csv(r'C:\Users\Benutzer1\Ironhack\Week_1\Day_2\Morning\lab-customer-analysis-round-1\files_for_lab\csv_files\file1.csv')
df2=pd.read_csv(r'C:\Users\Benutzer1\Ironhack\Week_1\Day_2\Morning\lab-customer-analysis-round-1\files_for_lab\csv_files\file2.csv')
df3=pd.read_csv(r'C:\Users\Benutzer1\Ironhack\Week_1\Day_2\Morning\lab-customer-analysis-round-1\files_for_lab\csv_files\file3.csv')
#df1=pd.read_csv('../files_for_lab/csv_files/file1.csv')
#df2=pd.read_csv('../files_for_lab/csv_files/file2.csv')
#df3=pd.read_csv('../files_for_lab/csv_files/file3.ccsv')

# Show the DataFrame's shape.

In [154]:
print(df1.shape,df2.shape,df3.shape)

(4008, 11) (996, 11) (7070, 11)

# Standardize header names.

In [155]:
df1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [156]:
df2.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [157]:
df3.head()

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [158]:
df1.columns.unique()

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [159]:
df2.columns.unique()

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [160]:
df3.columns.unique()

Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [161]:
df1 = df1.rename(columns={'ST':'State',
                                'GENDER':'Gender'})                                
df2 = df2.rename(columns={'ST':'State',
                                'GENDER':'Gender'})

In [162]:
df1.columns.unique()

Index(['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [163]:
df2.columns.unique()

Index(['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

# Rearrange the columns in the dataframe as needed

In [164]:
df1=df1[['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class']]
df2=df2[['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class']]
df3=df3[['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class']]

In [165]:
df1.head()

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,2.704934,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,1131.464935,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,566.472247,Personal Auto,Two-Door Car
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,529.881344,Corporate Auto,SUV
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,17.269323,Personal Auto,Four-Door Car

In [166]:
df3.head()

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,499.200000,Personal Auto,Two-Door Car
1,TB86706,Arizona,M,Master,2502.637401,0,66,0,3.468912,Personal Auto,Two-Door Car
2,ZL73902,Nevada,F,Bachelor,3265.156348,25820,82,0,393.600000,Personal Auto,Four-Door Car
3,KX23516,California,F,High School or Below,4455.843406,0,121,0,699.615192,Personal Auto,SUV
4,FN77294,California,M,High School or Below,7704.958480,30366,101,2,484.800000,Personal Auto,SUV

# Concatenate the three dataframes

In [167]:
data=pd.concat([df1,df2, df3], axis=0,ignore_index=True)

In [168]:
print(df1.shape,df2.shape,df3.shape,data.shape)

(4008, 11) (996, 11) (7070, 11) (12074, 11)

# Which columns are numerical?

In [169]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   9137 non-null   object
 1   State                      9137 non-null   object
 2   Gender                     9015 non-null   object
 3   Education                  9137 non-null   object
 4   Customer Lifetime Value    9130 non-null   object
 5   Income                     9137 non-null   float64
 6   Monthly Premium Auto       9137 non-null   float64
 7   Number of Open Complaints  9137 non-null   object
 8   Total Claim Amount         9137 non-null   float64
 9   Policy Type                9137 non-null   object
 10  Vehicle Class              9137 non-null   object
dtypes: float64(3), object(8)
memory usage: 1.0+ MB

In [170]:
#Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount are numerical

# Which columns are categorical?

In [171]:
#customers,state,gender,education,policy type,Veheicle class are categorical

# Understand the meaning of all columns

# Perform the data cleaning operations mentioned so far in class

Delete the column education and the number of open complaints from the dataframe.

In [172]:
data = data.drop(['Education','Number of Open Complaints'], axis=1)

In [173]:
data.columns.unique()

Index(['Customer', 'State', 'Gender', 'Customer Lifetime Value', 'Income',
       'Monthly Premium Auto', 'Total Claim Amount', 'Policy Type',
       'Vehicle Class'],
      dtype='object')

Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [174]:
data2=data.copy()

data2['Customer Lifetime Value'].value_counts(dropna=False)

NaN                   2944
4270.034393999999        6
6521.368813              6
20096.893369999998       6
10083.48688              6
                      ...
366737.50%               1
743769.33%               1
9409.143498000001        1
9410.670129              1
755650.75%               1
Name: Customer Lifetime Value, Length: 8212, dtype: int64

In [175]:
def clean_median2(x): #remove the values that contains '%'
    if (isinstance(x,float)):
        return x
    elif (isinstance(x,int)):
        return float(x)
    else:
        temp = ""
        for index, value in enumerate(x):
            if (value.isdigit()== True or (value in [".","-"])):
                temp += value
        x = float(temp)
        return x
    
data2['Customer Lifetime Value'] = list(map(clean_median2,data2['Customer Lifetime Value']))
data2[['Customer Lifetime Value']]
#data2['Customer Lifetime Value'] = data2['Customer Lifetime Value'].apply(clean_string)   
#data2['Customer Lifetime Value'] = list(map(clean_median,data2['Customer Lifetime Value']))

       Customer Lifetime Value
0                          NaN
1                 6.979536e+05
2                 1.288743e+06
3                 7.645862e+05
4                 5.363077e+05
...                        ...
12069             2.340599e+04
12070             3.096511e+03
12071             8.163890e+03
12072             7.524442e+03
12073             2.611837e+03

[12074 rows x 1 columns]

In [176]:
data2['Customer Lifetime Value'].value_counts(dropna=False)

NaN              2944
5096.673223         6
5246.278375         6
2719.506996         6
2659.705650         6
                 ...
501175.160000       1
2869.997625         1
11196.460020        1
2563.394054         1
292497.670000       1
Name: Customer Lifetime Value, Length: 8212, dtype: int64

In [177]:
data2['Customer Lifetime Value'] =  pd.to_numeric(data2['Customer Lifetime Value'], errors='coerce')#change into numerical type

In [178]:
data2['Customer Lifetime Value'].value_counts(dropna=False)

NaN              2944
5096.673223         6
5246.278375         6
2719.506996         6
2659.705650         6
                 ...
501175.160000       1
2869.997625         1
11196.460020        1
2563.394054         1
292497.670000       1
Name: Customer Lifetime Value, Length: 8212, dtype: int64

In [179]:
data2['Customer Lifetime Value']=data2['Customer Lifetime Value']*100
#data2['Customer Lifetime Value'].apply(lambda x: x*100)

In [180]:
data2.info()
data2
#data2.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Customer                 9137 non-null   object
 1   State                    9137 non-null   object
 2   Gender                   9015 non-null   object
 3   Customer Lifetime Value  9130 non-null   float64
 4   Income                   9137 non-null   float64
 5   Monthly Premium Auto     9137 non-null   float64
 6   Total Claim Amount       9137 non-null   float64
 7   Policy Type              9137 non-null   object
 8   Vehicle Class            9137 non-null   object
dtypes: float64(4), object(5)
memory usage: 849.1+ KB

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Total Claim Amount,Policy Type,Vehicle Class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,2.704934,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,6.979536e+07,0.0,94.0,1131.464935,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,1.288743e+08,48767.0,108.0,566.472247,Personal Auto,Two-Door Car
3,WW63253,California,M,7.645862e+07,0.0,106.0,529.881344,Corporate Auto,SUV
4,GA49547,Washington,M,5.363076e+07,36357.0,68.0,17.269323,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...,...,...
12069,LA72316,California,M,2.340599e+06,71941.0,73.0,198.234764,Personal Auto,Four-Door Car
12070,PK87824,California,F,3.096511e+05,21604.0,79.0,379.200000,Corporate Auto,Four-Door Car
12071,TD14365,California,M,8.163890e+05,0.0,85.0,790.784983,Corporate Auto,Four-Door Car
12072,UP19263,California,M,7.524442e+05,21941.0,96.0,691.200000,Personal Auto,Four-Door Car
12073,Y167826,California,M,2.611837e+05,0.0,77.0,369.600000,Corporate Auto,Two-Door Car

Check for duplicate rows in the data and remove if any.

In [181]:
print(data.shape)

(12074, 9)

In [182]:
data2 = data2.drop_duplicates()

In [183]:
print(data2.shape)

(9135, 9)

Filter out the data for customers who have an income of 0 or less.

In [184]:
data2[data2['Income']<=0].shape

(2294, 9)

In [185]:
data2[data2['Income']<=0]

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Total Claim Amount,Policy Type,Vehicle Class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,2.704934,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,6.979536e+07,0.0,94.0,1131.464935,Personal Auto,Four-Door Car
3,WW63253,California,M,7.645862e+07,0.0,106.0,529.881344,Corporate Auto,SUV
7,CF85061,Arizona,M,7.216100e+07,0.0,101.0,363.029680,Corporate Auto,Four-Door Car
10,SX51350,California,M,4.738992e+07,0.0,67.0,482.400000,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...,...,...
12063,WZ45103,California,F,5.678050e+05,0.0,76.0,364.800000,Personal Auto,Four-Door Car
12065,RX91025,California,M,1.987226e+06,0.0,185.0,1950.725547,Personal Auto,SUV
12066,AC13887,California,M,4.628995e+05,0.0,67.0,482.400000,Corporate Auto,Two-Door Car
12071,TD14365,California,M,8.163890e+05,0.0,85.0,790.784983,Corporate Auto,Four-Door Car
12073,Y167826,California,M,2.611837e+05,0.0,77.0,369.600000,Corporate Auto,Two-Door Car

In [186]:
data2=data2.drop(data2[data2['Income']<=0].index)# delete the rows which income is 0 or less than 0

In [187]:
data2[data2['Income']<=0]

Empty DataFrame
Columns: [Customer, State, Gender, Customer Lifetime Value, Income, Monthly Premium Auto, Total Claim Amount, Policy Type, Vehicle Class]
Index: []